Revit 2024 API
IExternalEventHandler.Execute Method
 This method is called to handle the external event.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
void Execute(
	UIApplication app
)
Visual Basic
Sub Execute ( _
	app As UIApplication _
)
Visual C++
void Execute(
	UIApplication^ app
)
Parameters
app
Type: Autodesk.Revit.UI.UIApplication
See Also
IExternalEventHandler Interface
Autodesk.Revit.UI Namespace